config/etc/johbo/spacemacs.org
#+PROPERTY: header-args :tangle yes :results value silent

* OS integration
** Emacs server

*** PID file hacks

Need a way to write out a PID file so that I can manage =emacs-server= with
=supervisord= both on Linux and MacOS.

#+BEGIN_SRC emacs-lisp
  ;; Write a PID file if we are a daemon, so that supervisord can manage us with
  ;; pidproxy
  (defun my/write-pid-file ()
    "Write the Emacs PID into a file"
    (let ((pid-file "~/var/run/emacs-server.pid")
          (pid (number-to-string (emacs-pid))))
      (with-temp-file pid-file (insert pid))))

  (if (daemonp)
      (my/write-pid-file))
#+END_SRC

* General

** Tramp

Found a [[http://www.emacswiki.org/emacs/TrampMode][hint]] in the emacswiki to configure =tramp-shell-prompt-pattern=, so
that it will recognize the login prompt on [[http://nixos.org][NixOS]] machines:

#+BEGIN_SRC emacs-lisp
  (setq tramp-shell-prompt-pattern
        "\\(?:^\\|\r\\)[^]#$%>\n]*#?[]#$%>].* *\\(^[\\[[0-9;]*[a-zA-Z] *\\)*")
#+END_SRC

* Programming in Python

#+BEGIN_SRC emacs-lisp
 (setq flycheck-flake8rc "~/.nix-profile/etc/johbo/flake8rc")
 (setq python-fill-docstring-style (quote django))
#+END_SRC

* Programming in D

#+BEGIN_SRC emacs-lisp
  ;;(push '((d-mode . "stroustrup")) c-default-style)
#+END_SRC
